Join and Append Function In Pandas

Join

In [2]:
import pandas as pd

In [5]:
var1 = pd.DataFrame({"A":[1,2,3,4], "B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20,30,40], "D":[11,22,33,44]})

In [6]:
var1.join(var2)

   A   B   C   D
0  1  11  10  11
1  2  12  20  22
2  3  13  30  33
3  4  14  40  44

In [15]:
var3 = pd.DataFrame({"a":[1,2,3,4], "b":[11,12,13,14]}, index=["a", "b", "c", "d"])
var4 = pd.DataFrame({"c":[10,20], "d":[15,16]})

In [16]:
var3.join(var4)

   a   b   c   d
a  1  11 NaN NaN
b  2  12 NaN NaN
c  3  13 NaN NaN
d  4  14 NaN NaN

In [17]:
var3 = pd.DataFrame({"a":[1,2,3,4], "b":[11,12,13,14]}, index=["a", "b", "c", "d"])
var4 = pd.DataFrame({"c":[10,20], "d":[15,16]}, index=["a", "b"])

In [18]:
var3.join(var4)

   a   b     c     d
a  1  11  10.0  15.0
b  2  12  20.0  16.0
c  3  13   NaN   NaN
d  4  14   NaN   NaN

In [19]:
var4.join(var3)

    c   d  a   b
a  10  15  1  11
b  20  16  2  12

In [24]:
var4.join(var3, how="right") # outer works like a union

      c     d  a   b
a  10.0  15.0  1  11
b  20.0  16.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

In [25]:
var5 = pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
var6 = pd.DataFrame({"C":[12,2,32],"B":[41,51,61]})

In [28]:
var5.join(var6, lsuffix="_1", rsuffix="_2")

   A  B_1   C  B_2
0  1    4  12   41
1  2    5   2   51
2  3    6  32   61

Append

In [29]:
var7 = pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
var8 = pd.DataFrame({"C":[12,2],"B":[41,51]})

In [31]:
# var7.append(var8)

In [32]:
# var7.append(var8, ignore_index="True")